In [0]:
#reference https://www.w3resource.com/python-exercises/pandas/index-dataframe.php
import pandas as pd
import numpy as np
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df.pow(2))
newDf = df ** 2
print(newDf)

      X     Y     Z
0  6084  7056  7396
1  7225  8836  9409
2  9216  7921  9216
3  6400  6889  5184
4  7396  7396  6889
      X     Y     Z
0  6084  7056  7396
1  7225  8836  9409
2  9216  7921  9216
3  6400  6889  5184
4  7396  7396  6889

# #Initializing data frame with dictionary

In [50]:
import pandas as pd

dictdata = {'Match':[1.5,2,3,4.5,5,6],'Players':['Ind','Pak','Eng','SA','WI','Ban'] }
data = pd.DataFrame(dictdata)
print(data)
print("Summary of the basic information about this DataFrame and its data:")
print(data.info())
print("Data types of the columns of the said DataFrame:")
print(data.dtypes)
print("\nNow change the Data type of 'score' column from float to int:")
data.Match = data.Match.astype(int)
print(data.dtypes)

   Match Players
0    1.5     Ind
1    2.0     Pak
2    3.0     Eng
3    4.5      SA
4    5.0      WI
5    6.0     Ban
Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
Match      6 non-null float64
Players    6 non-null object
dtypes: float64(1), object(1)
memory usage: 176.0+ bytes
None
Data types of the columns of the said DataFrame:
Match      float64
Players     object
dtype: object

Now change the Data type of 'score' column from float to int:
Match       int64
Players    object
dtype: object

# **Convert** a given **list of lists** into a **Dataframe**

In [52]:
#but each list becomes are record or a row not a SEPERATE column
import pandas as pd
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]
# sets the headers as list
headers = my_lists.pop(0) 
print("Original list of lists:")
print(my_lists)
df = pd.DataFrame(my_lists, columns = headers)
print("New DataFrame")
print(df)

Original list of lists:
[[2, 4], [1, 3]]
New DataFrame
   col1  col2
0     2     4
1     1     3

# Select multiple Columns

In [0]:
#select the 'name' and 'score' columns, we creat LIST of COLUMN names for selecting specific columns
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

# Slicing DataFrame
Pandas program to get the first 3 rows of a given DataFrame

In [0]:
#loc for EXPLICIT indexing So we get 3 Rows and all columns
print(data.loc[0:2, :])
#iloc for IMPLICIT indexing with 3 rows and One column
print(data.iloc[0:3, 0:1])

   Match Players
0      1     Ind
1      2     Pak
2      3     Eng
   Match
0      1
1      2
2      3

Select the specified columns and rows

In [0]:
print(df[['name','score']].iloc[0:3])
df.iloc[[1, 3, 5, 6], [1, 3]]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

# Select the rows with Specific Conditions
where the number of attempts in the examination is greater than 2

In [0]:
print(df)
df[df['attempts']>2]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

Count the **number** of **rows** and **columns**

In [0]:
#Axes 0 is for ROWS and Axes 1 for columns 
total_rows=len(df.axes[0])
total_cols=len(df.axes[1])
print("Number of Rows: "+str(total_rows))
print("Number of Columns: "+str(total_cols))

Number of Rows: 10
Number of Columns: 4

# Select the **rows**  on specific condition
where the score is missing, i.e. is **NaN** bold text

In [0]:
#NOT WORKING
# import numpy as np
# df[df['score'] == np.NAN]
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [39]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print('Rows for colum1 value == 4')
#Both of them works 
#print(df.loc[df['col1'] == 4])
df[df['col1'] == 4]

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
Rows for colum1 value == 4

   col1  col2  col3
1     4     5     8
3     4     7     0

In [0]:
#Wrong trials 
#df[df['score'] >= 15 and df['score'] <=20]
#df[df['score'] >= 15 & df['score'] <=20]
#The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().
#Right procedures
print(df[(df['score'] >= 15) & (df['score'] <=20)])
#in built method
df[df['score'].between(15, 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [0]:
#Normally we use "and" for and operaton but as we can see up we are replacing it with "&" inside bracket of dataframe  
i = 10
j = 89
if(i > 5 and j < 100):
  print("Yes")

Yes

Select the rows where number of **attempts** in the **examination** is **less than 2** and **score greater than 15**

In [0]:
df[(df['score'] > 15) & (df['attempts'] <2)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

Change the **score** in **row 'd'** to **11.5**

In [0]:
df['score'].loc['d'] = 11.5
# even it can be written as 
#df.loc['d', 'score'] = 11.5
df

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [0]:
print("\nSum of the examination attempts by the students:")
print(df['attempts'].sum())

Sum of the examination attempts by the students:
19

Calculate the **mean** score for **each different student** in DataFrame

In [0]:
df.groupby('name')['score','attempts'].mean()

           score  attempts
name
Anastasia   12.5         1
Dima         9.0         3
Emily        9.0         2
James       11.5         3
Jonas       19.0         1
Katherine   16.5         2
Kevin        8.0         2
Laura        NaN         1
Matthew     14.5         1
Michael     20.0         3

# Add **new** row 'k' to data frame with given values for each column.

In [0]:
#name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"
print(df)
#Wrong trails
#df.append(name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k")
#df.loc['k']= [name : "Suresh", score: 15.5, attempts: 1, qualify: "yes"]    invalid syntax
df.loc['k'] = ["Suresh", 15.5, 1, "Yes"]
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     Yes

# Delete the row from DataFrame

In [0]:
print("\nDelete the new row and display the original  rows:")
df = df.drop('k')
print(df)

Delete the new row and display the original  rows:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# Sorting

In [0]:
df.sort_values(by=['name', 'score'], ascending=[False, True])
print("Sort the data frame first by ‘name’ in descending order, then by ‘score’ in ascending order:")
print(df)
df.sort_values('name')

Sort the data frame first by ‘name’ in descending order, then by ‘score’ in ascending order:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James    NaN         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes

Sort based on **two** **columns**

In [46]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame:")
print(df)
print("\nSort the above DataFrame on attempts, name:")
df = df.sort_values(['attempts', 'name'], ascending=[True, True])
print(df)

Original DataFrame:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Sort the above DataFrame on attempts, name:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
9      Jonas   19.0         1     yes
7      Laura    NaN         1      no
6    Matthew   14.5         1     yes
4      Emily    9.0         2      no
2  Katherine   16.5         2     yes
8      Kevin    8.0         2      no
1       Dima    9.0         3      no
3      James    NaN         3      no
5    Michael   20.0         3     yes

Better reference for multiple columns
https://www.geeksforgeeks.org/python-pandas-dataframe-sort_values-set-2/

# Replace 
The '**qualify**' column contains the values '**yes**' and '**no**' with **True** and **False**.

In [0]:
import pandas as pd
import numpy as np

exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)

# print("\nReplace the ‘qualify' column contains the values 'yes' and 'no'  with True and  False:")
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print(df)

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [0]:

df['qualify'] = df['qualify'].map({True : 'yes',  False :'no'})
print(df)
#raw method whcih i have done 
df['qualify'] = df['qualify'].replace('yes','True')
df['qualify'] = df['qualify'].replace('no','False')
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d      James    NaN         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

In [0]:
print("\nChange the name 'James' to ‘Suresh’:")
df['name'] = df['name'].replace('James', 'Suresh')
print(df)

Change the name 'James' to ‘Suresh’:
        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d     Suresh    NaN         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

# Delete the column

In [0]:
#Inserting a temp column for deleting it 
df['NewTempCol'] = 1
print(df)
del df['NewTempCol']
df

#df.pop('attempts') will also work

        name  score  attempts qualify  NewTempCol
a  Anastasia   12.5         1    True           1
b       Dima    9.0         3   False           1
c  Katherine   16.5         2    True           1
d     Suresh    NaN         3   False           1
e      Emily    9.0         2   False           1
f    Michael   20.0         3    True           1
g    Matthew   14.5         1    True           1
h      Laura    NaN         1   False           1
i      Kevin    8.0         2   False           1
j      Jonas   19.0         1    True           1

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d     Suresh    NaN         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

# Insert New Column

In [0]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color'] = color
df

        name  score  attempts qualify   color
a  Anastasia   12.5         1    True     Red
b       Dima    9.0         3   False    Blue
c  Katherine   16.5         2    True  Orange
d     Suresh    NaN         3   False     Red
e      Emily    9.0         2   False   White
f    Michael   20.0         3    True   White
g    Matthew   14.5         1    True    Blue
h      Laura    NaN         1   False   Green
i      Kevin    8.0         2   False   Green
j      Jonas   19.0         1    True     Red

# Iterate over rows in a DataFrame

In [30]:
import pandas as pd
import numpy as np
#The below both methods can be used for intializing the data frame
#exam_data = {'name':['Anastasia','Dima','Katherine'], 'score':[12.5,9,16.5]}
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]
print(exam_data)
df = pd.DataFrame(exam_data)
for index, row in df.iterrows():
    print(index, row['name'], row['score'])

[{'name': 'Anastasia', 'score': 12.5}, {'name': 'Dima', 'score': 9}, {'name': 'Katherine', 'score': 16.5}]
0 Anastasia 12.5
1 Dima 9.0
2 Katherine 16.5

**Get list** from DataFrame column headers

In [31]:
#df['name'].values
print(df.name.values)
col_list = df["name"].tolist()
print("Column of the DataFrame to list:")
print(col_list)

['Anastasia' 'Dima' 'Katherine']
Col2 of the DataFrame to list:
['Anastasia', 'Dima', 'Katherine']

**Rename** columns of a given DataFrame

In [11]:
df.columns = ['Column1', 'Column2']
print(df)
#Another method to rename 
df = df.rename(columns={'Column1': 'name', 'Column2': 'score'})
print("New DataFrame after renaming columns:")
df

     Column1  Column2
0  Anastasia     12.5
1       Dima      9.0
2  Katherine     16.5
New DataFrame after renaming columns:

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5

**Change** the order of a DataFrame columns

In [40]:
print("Original DataFrame")
print(df)
print('After altering col1 and col3')
df = df[['col3', 'col2', 'col1']]
df

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
After altering col1 and col3

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

**Add one row** in an existing DataFrame

In [41]:
import pandas as pd

# Data Frame cant be added in both below was they are
#inserting all those elements to first column both with {} [] 
# df2 = pd.DataFrame([1,2,3])
# df2 = pd.DataFrame(cpl1{1,2,3})
#Error with intialization 
# datadic  = {'col1' : 1,'col2' : 2,'col3' : 3}
# ValueError: If using all scalar values, you must pass an index
#Correct methods
# datadic  = {'col1' : 1,'col2' : 2,'col3' : 3}
# df2 = pd.DataFrame(datadic, index=[5])
#OR can do as below
df2 = pd.DataFrame({'col1': [1], 'col2': [2],'col3': [3] })
df = df.append(df2)
df

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
0     1     2     3

# Group by operations

In [7]:
import pandas as pd
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles'], 'Rewards': ['1', '2', '3', '4', '6', '3', '3', '2', '1', '5']})
print(df1)
df1.groupby('city').count()
#https://www.geeksforgeeks.org/python-pandas-dataframe-groupby/

        name         city Rewards
0  Anastasia   California       1
1       Dima  Los Angeles       2
2  Katherine   California       3
3      James   California       4
4      Emily   California       6
5    Michael  Los Angeles       3
6    Matthew  Los Angeles       3
7      Laura      Georgia       2
8      Kevin      Georgia       1
9      Jonas  Los Angeles       5

             name  Rewards
city
California      4        4
Georgia         2        2
Los Angeles     4        4

Group by the **first column** and get **second column** as **lists** in rows

In [54]:
import pandas as pd
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print("Original DataFrame")
print(df)
#groupby object created
print(df.groupby('col1')['col2'])
df = df.groupby('col1')['col2'].apply(list)
print("\nGroup on the col1:")
print(df)

Original DataFrame
  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5
<pandas.core.groupby.generic.SeriesGroupBy object at 0x7f7f732b4198>

Group on the col1:
col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

Delete **DataFrame** row(s) based on given column value

In [11]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print('Original data frame ')
print(df)
#Alternative methods
#df = df[df.col2 != 5]
for index, row in df.iterrows():
    if(row['col1'] == 4):
      df = df.drop(index)
df

Original data frame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

   col1  col2  col3
0     1     4     7
2     3     6     9
4     5     8     1

**Insert** a given **column** at a specific column index in a DataFrame

In [51]:
import pandas as pd
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
new_col = [1, 2, 3, 4, 7]  
# insert the said column at the beginning in the DataFrame
idx = 0
df.insert(loc=idx, column='col1', value=new_col)
print("\nNew DataFrame")
print(df)

Original DataFrame
   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

New DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Widen output display to see more columns

In [12]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
print("Original DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Replace all the **NaN** values with **Zero's** in a column

In [0]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame")
print(df)
df =  df.fillna(0)
print("\nNew DataFrame replacing all NaN with 0:")
print(df)

Convert **index** in a column and hide extra indexes created

In [13]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame")
print(df)
print("\nAfter converting index in a column:")
df.reset_index(level=0, inplace=True)
print(df)
print("\nHiding index:")
print( df.to_string(index=False))

Original DataFrame
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

After converting index in a column:
   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

Hiding index:
 index       name  score  attempts qualify
     0  Anastasia   12.5         1     yes
     1       Dima    9.0         3      no
     2  Katherine   16.5         2     yes
     3      James    NaN         3      no
     4      Emily    9.0         2      no
     5    Michael   20.0         3     yes
     6    Matthew   14.5         1     yes
     7      Laura    NaN         1      no
     8      Kevin    8.0         2      no
     9      Jonas   19.0         1     yes

**Set a given value for particular cell in DataFrame**

In [19]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame")
print(df)
print("\nSet a given value for particular cell in the DataFrame")
df.set_value(8, 'score', 10.2)
print(df)
#alternative methods
df.iloc[8,1]= 20
#can use explilict only with iloc
df.loc[0,'score'] = 10
print(df)

Original DataFrame
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Set a given value for particular cell in the DataFrame
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin   10.2         2      no
9      Jonas   19.0         1     yes
        name  score  attempts qualify
0  Anastasia   10.0         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin   20.0         2      no
9      Jonas   19.0         1     yes

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:11: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  # This is added back by InteractiveShellApp.init_path()

In [25]:
print("\nNumber of NaN values in one or more columns:")
print(df.isnull())
print(df.isnull().values)
print(df.isnull().values.sum())

Number of NaN values in one or more columns:
    name  score  attempts  qualify
0  False  False     False    False
1  False  False     False    False
2  False  False     False    False
3  False   True     False    False
4  False  False     False    False
5  False  False     False    False
6  False  False     False    False
7  False   True     False    False
8  False  False     False    False
9  False  False     False    False
[[False False False False]
 [False False False False]
 [False False False False]
 [False  True False False]
 [False False False False]
 [False False False False]
 [False False False False]
 [False  True False False]
 [False False False False]
 [False False False False]]
2

Drop a **list of rows**   from a specified DataFrame

In [26]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(d)
print("Original DataFrame")
print(df)
print("New DataFrame after removing 2nd & 4th rows:")
df = df.drop(df.index[[2,4]])
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
New DataFrame after removing 2nd & 4th rows:
   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

**Reset Index**

In [27]:
print("\nAfter removing first and second rows")
df = df.drop([0, 1])
print(df)
print("\nReset the Index:")
df = df.reset_index()
print(df)

After removing first and second rows
   col1  col2  col3
3     4     7     0

Reset the Index:
   index  col1  col2  col3
0      3     4     7     0

Devide a DataFrame in a **given ratio**

In [28]:
df = pd.DataFrame(np.random.randn(10, 2))
print("Original DataFrame:")
print(df)
part_70 = df.sample(frac=0.7,random_state=10)
part_30 = df.drop(part_70.index)
print("\n70% of the said DataFrame:")
print(part_70)
print("\n30% of the said DataFrame:")
print(part_30)

Original DataFrame:
          0         1
0  0.288967  0.079889
1  1.164540 -1.720052
2  1.247026 -0.581743
3 -1.254806  0.282391
4  0.198113  0.333442
5  1.493712  0.800747
6  0.730433 -1.887387
7 -1.327954 -0.463323
8  0.342122  1.920221
9 -1.226838 -0.406145

70% of the said DataFrame:
          0         1
8  0.342122  1.920221
2  1.247026 -0.581743
5  1.493712  0.800747
6  0.730433 -1.887387
3 -1.254806  0.282391
1  1.164540 -1.720052
0  0.288967  0.079889

30% of the said DataFrame:
          0         1
4  0.198113  0.333442
7 -1.327954 -0.463323
9 -1.226838 -0.406145

**Combining** two **series** into a DataFrame using **concat**

In [29]:
import pandas as pd
import numpy as np
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])
print("Data Series:")
print(s1)
print(s2)
df = pd.concat([s1, s2], axis=1)
print("New DataFrame combining two series:")
print(df)

Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
0       10
1       20
2      php
3    30.12
4       40
dtype: object
New DataFrame combining two series:
        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

Find the row for where the value of a given column is maximum

In [43]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("Row where col1 has maximum value:")
print(df['col1'].argmax())
print("Row where col2 has maximum value:")
print(df['col2'].argmax())
print("Row where col3 has maximum value:")
print(df['col3'].idxmax())
#Wrong trail
# df[df['col1'].max()]
print("Row with highest value of columen3 ")
print(df[df['col3'] == df.iloc[df['col3'].argmax(),2]])
#Extracted the value of the row using Iloc providing colum and row then comparedd its value to get the row

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Row where col1 has maximum value:
4
Row where col2 has maximum value:
3
Row where col3 has maximum value:
2

   col1  col2  col3
2     3     6    12

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:7: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  import sys
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:9: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  if __name__ == '__main__':
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:15: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  from ipykernel import kernelapp as app

Miscellaneous

In [61]:

import pandas as pd
d = {'col1': [1, np.inf, -np.inf, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print(df)
#Removing infinite values
df = df.replace([np.inf, -np.inf], np.nan)
print(df)
print("\nIndex of 'col2'")
print(df.columns.get_loc("col2"))

print("\nAll columns except 'col3':")
df2 = df.loc[:, df.columns != 'col3']
print(df2)

print("\nLast 3 rows of the said DataFrame':")
print(df.tail(3))

   col1  col2  col3
0   1.0     4     7
1   inf     5     8
2  -inf     6    12
3   4.0     9     1
4   7.0     5    11
   col1  col2  col3
0   1.0     4     7
1   NaN     5     8
2   NaN     6    12
3   4.0     9     1
4   7.0     5    11

Index of 'col2'
1

All columns except 'col3':
   col1  col2
0   1.0     4
1   NaN     5
2   NaN     6
3   4.0     9
4   7.0     5

Last 3 rows of the said DataFrame':
   col1  col2  col3
2   NaN     6    12
3   4.0     9     1
4   7.0     5    11